tiborsimon/embedded-tdd-headers/pic/pic16/pic16f570_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16F570_H_
#define _PIC16F570_H_

#define INDF                          0
#define TMR0                          1
#define PCL                           2
#define STATUS                        3
#define STATUS_C                      4
#define CARRY                         5
#define STATUS_DC                     6
#define ZERO                          7
#define STATUS_Z                      8
#define STATUS_nPD                    9
#define STATUS_nTO                    10
#define STATUS_PA0                    11
#define STATUS_PA1                    12
#define STATUS_PA2                    13
#define FSR                           14
#define OSCCAL                        15
#define CAL0                          16
#define CAL                           17
#define CAL1                          18
#define CAL2                          19
#define CAL3                          20
#define CAL4                          21
#define CAL5                          22
#define CAL6                          23
#define PORTA                         24
#define RA0                           25
#define RA                            26
#define RA1                           27
#define RA2                           28
#define RA3                           29
#define RA4                           30
#define RA5                           31
#define RA6                           32
#define RA7                           33
#define PORTB                         34
#define RB0                           35
#define RB                            36
#define RB1                           37
#define RB2                           38
#define RB3                           39
#define RB4                           40
#define RB5                           41
#define RB6                           42
#define RB7                           43
#define PORTC                         44
#define RC0                           45
#define RC                            46
#define RC1                           47
#define RC2                           48
#define RC3                           49
#define RC4                           50
#define RC5                           51
#define RC6                           52
#define RC7                           53
#define ADCON0                        54
#define ADON                          55
#define GO_nDONE                      56
#define NOT_DONE                      57
#define GO                            58
#define CHS                           59
#define CHS0                          60
#define CHS1                          61
#define CHS2                          62
#define CHS3                          63
#define ADCS                          64
#define ADCS0                         65
#define ADCS1                         66
#define ADRES                         67
#define ADRES0                        68
#define ADRES1                        69
#define ADRES2                        70
#define ADRES3                        71
#define ADRES4                        72
#define ADRES5                        73
#define ADRES6                        74
#define ADRES7                        75
#define INTCON0                       76
#define GIE                           77
#define RBIF                          78
#define T0IF                          79
#define CWIF                          80
#define ADIF                          81
#define EECON                         82
#define RD                            83
#define WR                            84
#define WREN                          85
#define WRERR                         86
#define FREE                          87
#define EEDATA                        88
#define EEADR                         89
#define CM1CON0                       90
#define nC1WU                         91
#define C1PREF                        92
#define C1NREF                        93
#define C1ON                          94
#define nC1T0CS                       95
#define C1POL                         96
#define nC1OUTEN                      97
#define C1OUT                         98
#define CM2CON0                       99
#define nC2WU                         100
#define C2PREF1                       101
#define C2NREF                        102
#define C2ON                          103
#define C2PREF2                       104
#define C2POL                         105
#define nC2OUTEN                      106
#define C2OUT                         107
#define VRCON                         108
#define VR0                           109
#define VR                            110
#define VR1                           111
#define VR2                           112
#define VR3                           113
#define VRR                           114
#define VROE2                         115
#define VROE1                         116
#define VREN                          117
#define ANSEL                         118
#define ANS0                          119
#define ANS1                          120
#define ANS2                          121
#define ANS3                          122
#define ANS4                          123
#define ANS5                          124
#define ANS6                          125
#define ANS7                          126
#define IW                            127
#define IWREG                         128
#define INTCON1                       129
#define WUR                           130
#define RBIE                          131
#define T0IE                          132
#define CWIE                          133
#define ADIE                          134
#define ISTATUS                       135
#define ISTATUS_C                     136
#define ISTATUS_DC                    137
#define ISTATUS_Z                     138
#define ISTATUS_nPD                   139
#define ISTATUS_nTO                   140
#define ISTATUS_PA0                   141
#define ISTATUS_PA1                   142
#define ISTATUS_PA2                   143
#define IFSR                          144
#define IBSR                          145
#define OPACON                        146
#define OPA1ON                        147
#define OPA2ON                        148

#endif // _PIC16F570_H_
